#пустой хэш, который предстоит заполнить
hash = {}

#массив гласных букв, которыми нужно заполнить хэш
arr_vowels = ["a", "e", "i", "o", "u", "y"]

#интервал букв, преобразованный в массив
letters = ('a'..'z').to_a

#буквы - это ключи хэша, их порядковые номера в алфавите - значения

#пройти по всем элементам массива letters и узнать индекс этого элемента, составить пару буква-индекс
#затем "если массив arr_vowels включает в себя индекс нужной буквы (в нашем случае индекс перечисленных гласных),
#то добавить этот (индекс + 1) в пустой искомый хэш вместе с соответствующей буквой"

letters.each_with_index do |letter, index|
    hash[letter] = index + 1 if arr_vowels.index.include?(letter)
end

puts hash
