puts "Введите стороны треугольника"
puts "Сторона a равна:"
a = gets.chomp.to_f
puts "Сторона b равна:"
b = gets.chomp.to_f
puts "Сторона c равна:"
c = gets.chomp.to_f



if (a == b && c != a && c != b) || (a == c && b != a && b != c) || (c == b && a != b && a != c)
  puts "Ваш треугольник равнобедренный"
elsif a == b && b == c
  puts "Ваш треугольник равносторонний"
elsif (a ** 2 == b ** 2 + c ** 2) || (b ** 2 == a ** 2 + c ** 2) || (c ** 2 == a ** 2 + b ** 2)
  puts "Ваш треугольник прямоугольный"
else
  puts "Треугольник не является равнобедренным, равносторонним или прямоугольным"
end